Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: A computer-readable storage medium, wherein the computer-readable storage medium stores a computer program, and when the computer program is run on an electronic device, the electronic device is enabled to perform the method according to any one of claims 6 to 10.
de_de: Computerlesbares Speichermedium, wobei das computerlesbare Speichermedium ein Computerprogramm speichert und, wenn das Computerprogramm auf einer elektronischen Vorrichtung läuft, die elektronische Vorrichtung in die Lage versetzt wird, das Verfahren gemäß einem der Ansprüche 6 bis 10 durchzuführen.

source: 1. A detection and communication system, comprising:
de_de: 1. Detektions- und Kommunikationssystem, umfassend:

source: N radars, configured to: separately search for a target, and separately align with the target, wherein N is an integer greater than 1; and
de_de: N Radargeräte, die konfiguriert sind, um separat nach einem Ziel zu suchen und sich separat auf das Ziel auszurichten, wobei N eine Ganzzahl größer als 1 ist; und

source: a first radar is configured to communicate with the target, a second radar is configured to track and point the target, the first radar is K radars that are in the N radars and that align with the target, the second radar is a radar other than the first radar in the N radars, and K is a positive integer less than N.
de_de: ein erstes Radargerät konfiguriert ist, um mit dem Ziel zu kommunizieren, ein zweites Radargerät konfiguriert ist, um das Ziel zu verfolgen und anzuvisieren, das erste Radargeräte K Radargeräte sind, die in den N Radargeräten sind und die sich auf das Ziel ausrichteten, das zweite Radargerät ein anderes Radargerät als das erste Radargerät in den N Radargeräten ist und K eine positive ganze Zahl kleiner als N ist.

source: 2. The system according to claim 1, wherein coverage regions of electromagnetic waves transmitted by the N radars overlap.
de_de: 2. System nach Anspruch 1, wobei sich die Abdeckungsbereiche der von den N Radargeräten übertragenen elektromagnetischen Wellen überlappen.

source: 3. The system according to claim 1 or 2, wherein a radar that is in the N radars and that finds the target is configured to feed back first information to a control apparatus, and the first information indicates a first distance between the target and the radar that finds the target; and
de_de: 3. System nach Anspruch 1 oder 2, wobei ein Radargerät, das in den N Radargeräten ist und das Ziel findet, konfiguriert ist, um erste Informationen an eine Steuervorrichtung zurückzumelden, und die ersten Informationen eine erste Entfernung zwischen dem Ziel und dem Radargerät angeben, das das Ziel findet; und

source: a radar that is in the N radars and that does not find the target is configured to: receive a first instruction from the control apparatus, and perform, based on the first instruction, searching in a region in which the target is located.
de_de: ein Radargerät, das in den N Radargeräten ist und das Ziel nicht findet, konfiguriert ist, um: eine erste Anweisung von der Steuervorrichtung zu empfangen und basierend auf der ersten Anweisung eine Suche in einem Bereich durchzuführen, in dem sich das Ziel befindet.

source: 4. The system according to claim 3, wherein if one radar finds the target, the first instruction is used to instruct the radar that does not find the target to perform searching on a spherical surface whose sphere center is the radar that finds the target and whose radius is the first distance.
de_de: 4. System nach Anspruch 3, wobei, wenn ein Radargerät das Ziel findet, die erste Anweisung dazu verwendet wird, das Radargerät, das das Ziel nicht findet, anzuweisen, eine Suche auf einer Kugeloberfläche durchzuführen, deren Kugelmittelpunkt das Radargerät ist, das das Ziel findet, und deren Radius der ersten Entfernung entspricht.

source: 5. The system according to claim 3, wherein N is an integer greater than 2, and if two radars find the target, the first instruction is used to instruct the radar that does not find the target to perform searching on a junction line of spherical surfaces corresponding to the two radars that find the target, wherein the spherical surface corresponding to the radar that finds the target is a spherical surface whose sphere center is the radar that finds the target and whose radius is the first distance.
de_de: 5. System nach Anspruch 3, wobei N eine Ganzzahl größer als 2 ist und, wenn zwei Radargeräte das Ziel finden, die erste Anweisung verwendet wird, um das Radargerät, das das Ziel nicht findet, anzuweisen, eine Suche auf einer Verbindungslinie von Kugeloberflächen durchzuführen, die den zwei Radargeräten entsprechen, die das Ziel finden, wobei die Kugeloberfläche, die dem Radargerät entspricht, das das Ziel findet, eine Kugeloberfläche ist, deren Kugelmittelpunkt das Radargerät ist, das das Ziel findet, und deren Radius die erste Entfernung ist.

source: 6. The system according to claim 3, wherein N is an integer greater than 3, and if at least three radars find the target, the first instruction is used to instruct the radar that does not find the target to perform searching at an intersection point of spherical surfaces corresponding to the at least three radars that find the target, wherein the spherical surface corresponding to the radar that finds the target is a spherical surface whose sphere center is the radar that finds the target and whose radius is the first distance.
de_de: 6. System nach Anspruch 3, wobei N eine Ganzzahl größer als 3 ist und, wenn mindestens drei Radargeräte das Ziel finden, die erste Anweisung verwendet wird, um das Radargerät, das das Ziel nicht findet, anzuweisen, eine Suche an einem Schnittpunkt von Kugeloberflächen durchzuführen, die den mindestens drei Radargeräten entsprechen, die das Ziel finden, wobei die Kugeloberfläche, die dem Radargerät entspricht, das das Ziel findet, eine Kugeloberfläche ist, deren Kugelmittelpunkt das Radargerät ist, das das Ziel findet, und deren Radius die erste Entfernung ist.

source: 7. The system according to claim 1 or 2, wherein the N radars are separately configured to:
de_de: 7. System nach Anspruch 1 oder 2, wobei die N Radargeräte separat konfiguriert sind, um:

source: receive an echo signal reflected from a detection region;
de_de: ein Echosignal zu empfangen, das von einem Detektionsbereich reflektiert wird;

source: determine, based on the received echo signal, point cloud data corresponding to the detection region; and
de_de: basierend auf dem empfangenen Echosignal Punktwolkendaten zu bestimmen, die dem Detektionsbereich entsprechen; und

source: feed back third information to a control apparatus, wherein the third information comprises the corresponding point cloud data.
de_de: dritte Informationen an eine Steuervorrichtung zurückzukoppeln, wobei die dritten Informationen die entsprechenden Punktwolkendaten umfassen.

source: 8. The system according to any one of claims 1 to 7, wherein each of the N radars corresponds to one feedback control component; and
de_de: 8. System nach einem der Ansprüche 1 bis 7, wobei jedes der N Radargeräte einer Rückkopplungssteuerkomponente entspricht; und

source: the feedback control component is configured to:
de_de: die Rückkopplungssteuerkomponente ist konfiguriert, um:

source: receive fourth information from the radar that finds the target, wherein the fourth information indicates a location relationship between the target and a central region of an electromagnetic wave transmitted by the radar that finds the target; and
de_de: vierte Informationen von dem Radargerät zu empfangen, das das Ziel findet, wobei die vierten Informationen eine Ortsbeziehung zwischen dem Ziel und einem zentralen Bereich einer elektromagnetischen Welle angeben, die von dem Radargerät übertragen wird, das das Ziel findet; und

source: generate a control instruction based on the fourth information, wherein the control instruction is used to instruct the central region of the electromagnetic wave transmitted by the radar that finds the target to align with the target.
de_de: eine Steueranweisung basierend auf den vierten Informationen zu erzeugen, wobei die Steueranweisung verwendet wird, um den zentralen Bereich der elektromagnetischen Welle, die von dem Radargerät übertragen wird, das das Ziel findet, anzuweisen, sich an dem Ziel auszurichten.

source: 9. The system according to any one of claims 3 to 7 or according to claim 8 in its reference to claim 7, wherein the second radar is further configured to:
de_de: 9. System nach einem der Ansprüche 3 bis 7 oder nach Anspruch 8 in der Bezugnahme auf Anspruch 7, wobei das zweite Radargerät ferner konfiguriert ist, um:

source: send second information to the control apparatus, wherein the second information indicates a location of the target after movement.
de_de: zweite Informationen an die Steuervorrichtung zu senden, wobei die zweiten Informationen einen Standort des Ziels nach der Bewegung angeben.

source: The system according to any one of claims 1 to 9, wherein the first radar is further configured to:
de_de: System nach einem der Ansprüche 1 bis 9, wobei das erste Radargerät ferner konfiguriert ist, um:

source: transmit a first electromagnetic wave to the target in a first time domain, wherein the first electromagnetic wave carries communication information; and
de_de: eine erste elektromagnetische Welle in einem ersten Zeitbereich an das Ziel zu übertragen, wobei die erste elektromagnetische Welle Kommunikationsinformationen trägt; und

source: transmit a second electromagnetic wave to the target in a second time domain, wherein the second electromagnetic wave is used to determine a first distance between the first radar and the target; and
de_de: eine zweite elektromagnetische Welle in einem zweiten Zeitbereich an das Ziel zu übertragen, wobei die zweite elektromagnetische Welle verwendet wird, um eine erste Entfernung zwischen dem ersten Radargerät und dem Ziel zu bestimmen; und

source: the second radar is further configured to:
de_de: das zweite Radargerät außerdem konfiguriert ist, um:

source: transmit a third electromagnetic wave to the target, wherein the third electromagnetic wave is used to determine a first distance between the second radar and the target.
de_de: eine dritte elektromagnetische Welle an das Ziel zu übertragen, wobei die dritte elektromagnetische Welle verwendet wird, um eine erste Entfernung zwischen dem zweiten Radargerät und dem Ziel zu bestimmen.

source: The system according to claim 10, wherein the first radar is further configured to:
de_de: System nach Anspruch 10, wobei die Steuerung ferner konfiguriert ist, um:

source: encode communication information to obtain a communication code;
de_de: Kommunikationsinformationen zu verschlüsseln, um einen Kommunikationscode zu erlangen;

source: combine the communication code and a ranging code, and modulate the combined communication code and ranging code onto a to-be-transmitted electromagnetic wave to obtain a fourth electromagnetic wave; and
de_de: den Kommunikationscode und einen Entfernungscode zu kombinieren und den kombinierten Kommunikationscode und Entfernungscode auf eine zu übertragende elektromagnetische Welle zu modulieren, um eine vierte elektromagnetische Welle zu erlangen; und

source: transmit the fourth electromagnetic wave to the target.
de_de: die vierte elektromagnetische Welle an das Ziel zu übertragen.

source: The system according to any one of claims 10 to 11, wherein the detection and communications system further comprises the target, and the target comprises a lens component, a reflection component, and a third detector, wherein
de_de: System nach einem der Ansprüche 10 bis 11, wobei das Detektions- und Kommunikationssystem das Ziel umfasst und das Ziel eine Linsenkomponente, eine Reflexionskomponente und einen dritten Detektor umfasst, wobei

source: the lens component is configured to converge the received first electromagnetic wave to the third detector;
de_de: die Linsenkomponente konfiguriert ist, um die empfangene erste elektromagnetische Welle zu dem dritten Detektor zu konvergieren;

source: the third detector is configured to demodulate the received first electromagnetic wave to obtain the communication information; and
de_de: der dritte Detektor konfiguriert ist, um die empfangene erste elektromagnetische Welle zu demodulieren, um die Kommunikationsinformationen zu erlangen; und

source: the reflection component is configured to: reflect the second electromagnetic wave to obtain a second echo signal, and reflect the third electromagnetic wave to obtain a third echo signal.
de_de: die Reflexionskomponente konfiguriert ist, um: die zweite elektromagnetische Welle zu reflektieren, um ein zweites Echosignal zu erlangen, und die dritte elektromagnetische Welle zu reflektieren, um ein drittes Echosignal zu erlangen.

source: The system according to any one of claims 3 to 6 or any one of claims 8 to 12 in its reference to claim 3, wherein the detection and communication system further comprises the control apparatus, wherein
de_de: System nach einem der Ansprüche 3 bis 6 oder einem der Ansprüche 8 bis 12 in der Bezugnahme auf Anspruch 3, wobei das Detektions- und Kommunikationssystem ferner die Steuervorrichtung umfasst, wobei

source: the control apparatus is configured to:
de_de: die Steuervorrichtung konfiguriert ist, um:

source: receive the first information from the radar that finds the target, wherein the first information indicates the first distance between the target and the radar that finds the target;
de_de: die ersten Informationen von dem Radargerät zu empfangen, das das Ziel findet, wobei die ersten Informationen den ersten Abstand zwischen dem Ziel und dem Radargerät angeben, das das Ziel findet;

source: determine, based on the first information, the region in which the target is located; and
de_de: basierend auf den ersten Informationen den Bereich zu bestimmen, in dem sich das Ziel befindet; und

source: generate the first instruction based on the region in which the target is located, and send the first instruction to the radar that does not find the target.
de_de: die erste Anweisung basierend auf dem Bereich zu erzeugen, in dem sich das Ziel befindet, und die erste Anweisung an das Radargerät zu senden, das das Ziel findet.

source: 1. A communication method performed by a terminal, the method comprising the steps of:
de_de: 1. Kommunikationsverfahren, das von einem Endgerät durchgeführt wird, wobei das Verfahren die folgenden Schritte umfasst:

source: if the terminal determines that at least one antenna is faulty, sending (S 304) first indication information to a network device, wherein the first indication information indicates an updated SRS transmit port switching mode supported by the terminal, and the updated SRS transmit port switching mode supported by the terminal comprises at least one antenna switching capability;
de_de: Senden (S 304) von ersten Angabeinformationen an eine Netzwerkvorrichtung, wenn das Endgerät feststellt, dass mindestens eine Antenne fehlerhaft ist, wobei die ersten Angabeinformationen einen aktualisierten, von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus angeben und der aktualisierte von dem Endgerät unterstützte SRS-Übertragungsport-Umschaltmodus mindestens eine Antennenumschaltfunktion umfasst;

source: receiving (S 305), from the network device, configuration information of SRS resources allocated to the terminal by the network device, wherein the SRS resources allocated to the terminal by the network device are adjusted SRS resources, wherein the adjusted SRS resources are less than SRS resources the terminal currently uses, and an extend of the adjustment of the SRS resources is divided into a plurality of levels based on a quantity of faulty antennas of the terminal, wherein the higher the quantity of faulty antennas of the terminal is, the less SRS resources are allocated within the framework of the adjustment of the SRS resources to the terminal.
de_de: Empfangen (S 305) von Konfigurationsinformationen von SRS-Ressourcen, die dem Endgerät durch die Netzwerkvorrichtung zugewiesen wurden, von der Netzwerkvorrichtung, wobei die dem Endgerät durch die Netzwerkvorrichtung zugewiesenen SRS-Ressourcen angepasste SRS-Ressourcen sind, wobei die angepassten SRS-Ressourcen weniger SRS-Ressourcen sind, als diejenigen, die das Endgerät derzeit verwendet, und ein Ausmaß der Anpassung der SRS-Ressourcen basierend auf einer Anzahl fehlerhafter Antennen des Endgeräts in eine Vielzahl von Stufen unterteilt ist, wobei dem Endgerät im Rahmen der Anpassung der SRS-Ressourcen umso weniger SRS-Ressourcen zugewiesen werden, je höher die Anzahl fehlerhafter Antennen des Endgeräts ist.

source: 2. The method according to claim 1, wherein, before the sending (S201) first indication information to the network device, the method further comprises:
de_de: 2. Verfahren nach Anspruch 1, wobei das Verfahren vor dem Senden (S201) von ersten Angabeinformationen an die Netzwerkvorrichtung ferner Folgendes umfasst:

source: sending (S 301) second indication information to the network device, wherein the second indication information indicates an SRS transmit port switching mode supported by the terminal, the SRS transmit port switching mode supported by the terminal comprises at least one antenna switching capability, the at least one antenna switching capability comprised in the SRS transmit port switching mode supported by the terminal respectively corresponds to an SRS resource, and a maximum SRS resource is a first SRS resource, and a maximum SRS resource corresponding to the at least one antenna switching capability comprised in the updated SRS transmit port switching mode supported by the terminal is less than the first SRS resource.
de_de: Senden (S 301) von zweiten Angabeinformationen an die Netzwerkvorrichtung, wobei die zweiten Angabeinformationen einen von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus angeben, wobei der von dem Endgerät unterstützte SRS-Übertragungsport-Umschaltmodus mindestens eine Antennenumschaltfähigkeit umfasst, wobei die in dem von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus umfasste mindestens eine Antennenumschaltfähigkeit jeweils einer SRS-Ressource entspricht, und eine maximale SRS-Ressource eine erste SRS-Ressource ist, und eine maximale SRS-Ressource, die der in dem von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus umfassten mindestens einen Antennenumschaltfähigkeit entspricht, weniger ist als die erste SRS-Ressource.

source: 3. The method according to any one of claims 1 or 2, wherein the first indication information is carried in user equipment assistance information.
de_de: 3. Verfahren nach einem der Ansprüche 1 oder 2, wobei die ersten Angabeinformationen in Benutzergeräte-Hilfeinformationen enthalten sind.

source: 4. The method according to claim 2, wherein a size of the SRS resource corresponding to the antenna switching capability is related to a quantity of SRS resources and a port quantity of the SRS resources.
de_de: 4. Verfahren nach Anspruch 2, wobei eine Größe der SRS-Ressource, die der Antennenumschaltfähigkeit entspricht, eine Anzahl von SRS-Ressourcen und eine Portanzahl der SRS-Ressourcen betrifft.

source: 5. A communication method performed by a network device, the method comprising the steps of:
de_de: 5. Kommunikationsverfahren, das von einer Netzwerkvorrichtung durchgeführt wird, wobei das Verfahren die folgenden Schritte umfasst:

source: receiving first indication information from a terminal, wherein the first indication information indicates an updated SRS transmit port switching mode supported by the terminal, and the updated SRS transmit port switching mode supported by the terminal comprises at least one antenna switching capability;
de_de: Empfangen erster Angabeinformationen von einem Endgerät, wobei die ersten Angabeinformationen einen von dem Endgerät unterstützten aktualisierten SRS-Übertragungsport-Umschaltmodus angeben, und der von dem Endgerät unterstützte aktualisierte SRS-Übertragungsport-Umschaltmodus mindestens eine Antennenumschaltfunktion umfasst;

source: determining configuration information of SRS resources allocated to the terminal by the network device based on the received first indication information, wherein the SRS resources allocated to the terminal by the network device are adjusted SRS resources, wherein the adjusted SRS resources are less than SRS resources the terminal currently uses, and an extend of the adjustment of the SRS resources is divided into a plurality of levels based on a quantity of faulty antennas of the terminal, wherein the higher the quantity of faulty antennas of the terminal is, the less SRS resources are allocated within the framework of the adjustment of the SRS resources to the terminal; and
de_de: Feststellen von Konfigurationsinformationen von SRS-Ressourcen, die dem Endgerät durch die Netzwerkvorrichtung basierend auf den empfangenen ersten Angabeinformationen zugewiesen wurden, wobei die dem Endgerät durch die Netzvorrichtung zugewiesenen SRS-Ressourcen angepasste SRS-Ressourcen sind, wobei die angepassten SRS-Ressourcen weniger SRS-Ressourcen sind, als diejenigen, die das Endgerät derzeit verwendet, und ein Ausmaß der Anpassung der SRS-Ressourcen basierend auf einer Anzahl fehlerhafter Antennen des Endgeräts in eine Vielzahl von Stufen unterteilt ist, wobei dem Endgerät im Rahmen der Anpassung der SRS-Ressourcen umso weniger SRS-Ressourcen zugewiesen werden, je höher die Anzahl fehlerhafter Antennen des Endgeräts ist; und

source: sending the configuration information to the terminal.
de_de: Senden der Konfigurationsinformationen an das Endgerät.

source: 6. The method according to claim 5, wherein, before the receiving the first indication information from the terminal, the method further comprises:
de_de: 6. Verfahren nach Anspruch 5, wobei das Verfahren vor dem Empfangen der ersten Angabeinformationen von dem Endgerät ferner umfasst:

source: receiving second indication information from the terminal, wherein the second indication information indicates an SRS transmit port switching mode supported by the terminal, the SRS transmit port switching mode supported by the terminal comprises at least one antenna switching capability, the at least one antenna switching capability comprised in the SRS transmit port switching mode supported by the terminal respectively corresponds to an SRS resource, and a maximum SRS resource is a first SRS resource, and a maximum SRS resource corresponding to the at least one antenna switching capability comprised in the updated SRS transmit port switching mode supported by the terminal is less than the first SRS resource.
de_de: Empfangen von zweiten Angabeinformationen von dem Endgerät, wobei die zweiten Angabeinformationen einen von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus angeben, wobei der von dem Endgerät unterstützte SRS-Übertragungsport-Umschaltmodus mindestens eine Antennenumschaltfähigkeit umfasst, wobei die in dem von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus umfasste mindestens eine Antennenumschaltfähigkeit jeweils einer SRS-Ressource entspricht, und eine maximale SRS-Ressource eine erste SRS-Ressource ist, und eine maximale SRS-Ressource, die der in dem von dem Endgerät unterstützten SRS-Übertragungsport-Umschaltmodus umfassten mindestens einen Antennenumschaltfähigkeit entspricht, weniger ist als die erste SRS-Ressource.
